⭐️Задание со звёздочкой!⭐️

Загрузите данные из Google Sheets, которые находятся по этой ссылке при помощи библиотеки requests. Посчитайте процент мужчин среди всех посетителей сайта, округлите ответ до целых.

Воспользуйтесь этим кодом, чтобы перевести данные из реквеста в пандас

In [3]:
import pandas as pd

In [4]:
from io import BytesIO
import requests


req = requests.get('https://docs.google.com/spreadsheets/d/1e3PRXmMNXo9AZZnaol1aHgYxtH6KYaCDymEQlK6jaO8/export?format=csv')
data = req.content

df = pd.read_csv(BytesIO(data)) #bytes input output - Для считывания бинарных файлов

In [5]:
df.head()

         date         gender  users
0  2020-06-14  Not specified    150
1  2020-06-14           male    117
2  2020-06-14         female     21

In [11]:
df.users.div(df.users.sum()) \
    .mul(100) \
    .round()

0    52.0
1    41.0
2     7.0
Name: users, dtype: float64

Скачайте файл с данными посещаемости сайта Яндекс.Метрика здесь. При помощи функции np.where создайте серию, в которую будет записываться 1, если посещения были сделаны роботами с браузера, содержащего Chrome в названии и 0, в других случаях. Поместите получившуюся серию в переменную chrome_robots

In [12]:
df_yandex = pd.read_csv('https://stepik.org/media/attachments/lesson/361619/karpov_courses_test.csv')

In [13]:
df_yandex.head()

         date         browser user_type  users
0  2020-06-14   Google Chrome    People    139
1  2020-06-14   Chrome Mobile    People     35
2  2020-06-14   Google Chrome    Robots     28
3  2020-06-14  Yandex Browser    People     22
4  2020-06-14         Firefox    People     15

In [14]:
import numpy as np

In [21]:
chrome_robots=np.where((df_yandex.user_type == 'Robots') & (df_yandex.browser.str.contains('Chrome')),1,0)

In [28]:
chrome_robots = pd.Series(chrome_robots)
chrome_robots

0     0
1     0
2     1
3     0
4     0
5     0
6     0
7     0
8     0
9     0
10    0
11    0
12    0
13    0
14    0
15    0
16    0
17    0
18    0
19    1
20    0
21    0
22    0
23    0
dtype: int64

⭐️Задание со звёздочкой!⭐️

У вас есть датасет по ссылке с данными о кликах и показах по объявлению, в этом датасете есть пропуски. Вычислите количество строк без пропусков в колонке click_type. Запишите ответ в переменную not_nan_count

ad_id - id объявления
user_id - id пользователя
click_type - тип клика (клик по заголовку объявления, клик по центру)

In [23]:
df_clicks = pd.read_csv('https://stepik.org/media/attachments/lesson/361619/sample_ads.csv')

In [29]:
df_clicks

    ad_id user_id click_type
0   12345   qwert        top
1   12345   fsssc     center
2   12345   vfvgg        NaN
3   12345   asrvv        NaN
4   12345   tynuy        top
5   12345   vreio        NaN
6   12345   oirbv        top
7   12345   kjvbe        NaN
8   12345   vkrej     center
9   12345   krjvb        top
10  12345   vrejn        top
11  12345   vrejk     center
12  12345   pirbv        NaN
13  12345    mpev        NaN
14  12345  pi3bvk        top
15  12345  osbvor     center
16  12345   vrbuo        NaN
17  12345   o3b0v        top

In [31]:
not_nan_count = df_clicks.click_type.notna().sum()
not_nan_count

11

⭐️Задание со звёздочкой!⭐️

В списке lst находятся различные элементы. Создайте списк new_list и сделайте следующее:

при помощи конструкции try except и цикла попробуйте преобразовать каждое значение в листе в int
если это получилось - добавьте преобразованное значение  в список new_list

In [33]:
lst = ['0','2','5']
new_list = []
for element in lst:
    try:
        new_list.append(int(element))
    except:
        continue

⭐️Задание со звёздочкой!⭐️

А теперь попробуем воспользоваться знаниями использования Telegram API. Отправьте себе в личку любое послание, а в ответ к этому шагу напишите ник бота, от имени которого будете отправлять сообщения.

https://stepik.org/lesson/443583/step/15?unit=433753

# Отправка сообщений

In [36]:
import requests
import json
from urllib.parse import urlencode
with open('/home/jupyter-i.tsukanov-7/Lesson_7/test.json') as src:
    data = json.load(src)
    
token = '1480674807:AAGhlYdif-sCATyBBF9rpAHVPPwpJj1PBDo'
chat_id = 166754739  # your chat id

message = 'test'  # text which you want to send

params = {'chat_id': chat_id, 'text': message}

base_url = f'https://api.telegram.org/bot1480674807:AAGhlYdif-sCATyBBF9rpAHVPPwpJj1PBDo/'
url = base_url + 'sendMessage?' + urlencode(params)
# Only if you need it
# proxy = {'https': 'https://77.48.23.199:57842'}

# To send request via proxy
# resp = requests.get(url, proxies=proxy)
resp = requests.get(url)

# Минипроект

Наш новый дополнительный минипроект довольно специфичен (у меня особые вкусы), а всё дело в том, что сейчас нам не нужно анализировать сами данные – нам просто нужно привести данные в порядок

Ваш друг из соседнего отдела прислал вам файл, где он собирал информацию о сделках с компаниями в течение нескольких месяцев. К сожалению, друг не особо аккуратен, и не знал, какой ужасный формат он выбрал...

Нужно собрать все данные в нормальный датафрэйм, и сказать другу, чтобы хранил данные аккуратнее

In [31]:
import pandas as pd

In [32]:
df = pd.read_excel('https://stepik.org/media/attachments/course/72204/tables.xlsx')

In [33]:
df.head()

,Unnamed: 0,company41,company51,company50,company76,company47,company27,company48
0,NaN,580,198,968,220,788,554,479
1,NaN,786,271,69,566,NaN,193,636
2,NaN,578,NaN,526,74,984,581,951
3,NaN,614,NaN,589,575,85,122,454
4,NaN,44,849,992,155,527,33,NaN

In [34]:
df.isna().sum(1).value_counts() #посчитаем кол-во nan в строке

1    22
2     9
8     8
3     4
4     1
dtype: int64

In [35]:
df.dropna(how='all', inplace = True)

In [36]:
df.reset_index(drop = True, inplace = True) #убираем индексы, т.к. они не проставлены нормально (ломается очередность)

In [37]:
df.isna().sum()

Unnamed: 0    31
company41      0
company51      2
company50      5
company76      3
company47      5
company27      3
company48      7
dtype: int64

In [38]:
part_df = df.loc[df['Unnamed: 0'].notna()].copy() #найдем все строки, в которых Unnamed: 0 не пустой
# copy() копируем дф, чтобы не изменился исходный

In [39]:
part_df.drop(columns = ['company48'], inplace = True)

In [40]:
part_df

,Unnamed: 0,company41,company51,company50,company76,company47,company27
18,company41,company51,company50,company76,company47,company27,company48
19,16,151,217,144,993,633,747
20,819,43,660,NaN,312,936,983
21,227,783,589,NaN,516,782,736
22,625,858,228,NaN,832,197,116

In [41]:
part_df.columns = part_df.loc[18]

In [42]:
part_df

18,company41,company51,company50,company76,company47,company27,company48
18,company41,company51,company50,company76,company47,company27,company48
19,16,151,217,144,993,633,747
20,819,43,660,NaN,312,936,983
21,227,783,589,NaN,516,782,736
22,625,858,228,NaN,832,197,116

In [43]:
part_df.drop(index = 18, inplace = True)

In [44]:
df = df.loc[df['Unnamed: 0'].isna()]

In [45]:
df.isna().sum()

Unnamed: 0    31
company41      0
company51      2
company50      2
company76      3
company47      5
company27      3
company48      2
dtype: int64

In [46]:
df.drop(columns=['Unnamed: 0'], inplace = True)

In [47]:
columns = []
for i, row in df.iterrows():
    try:
        row.astype(float)
    except:
        columns.append(i)
columns

[7, 14, 23, 30]

In [48]:
df.loc[columns]

,company41,company51,company50,company76,company47,company27,company48
7,company41,company51,company50,company76,company47,company27,company48
14,company41,company51,company50,company76,company47,company27,company48
23,company41,company51,company50,company76,company47,company27,company48
30,company41,company51,company50,company76,company47,company27,company48

In [49]:
df.drop(index = columns, inplace = True)

In [50]:
df = pd.concat((df, part_df))

In [51]:
df.company41.sum()

14918